# -*- coding: utf-8 -*-
"""
Created on Sat May 18 22:00:22 2019

@author: Gan
"""

import jieba
import wordcloud
from scipy.misc import imread
excludes = {"却说","二人","不可","不能","如此","如何","一军",'奈何','各自','何如',\
            "不见","接应","引军","军中","可以","心中","以为",'安敢','相待','前部',\
            '数十','自有','礼毕','直取','纵马','即日','往来','使人','莫非','大寨',\
            '回顾','大兵','此处','收拾','之上','果然','迎敌','向前','乃是','十万',\
            '各引','再三','后面','之地','回到','马上','不许','不必','大半','火起',\
            '汝二人','交战','之众','部将','至此','不曾','赶到','旌旗','厉声','五万',\
            '方可','而入','其余','当夜','直至','夹攻','大哭','自此','百官','须臾',\
            '无数','计议','必为','不足','今夜','之言','求救','数日','前去','诗赞',\
            '每日','不住','一个','其人','相助','正遇','比及','两边','遥望','闻言',\
            '大乱','围住','聚众','奋力','司马','大小','推出','众军','两下','之事',\
            '领命','早有','大骂', '分兵', '一将', '阵前', '之策','自引', '而进',\
            '回寨','早晚', '何必', '正在', '不想','只是', '劫寨', '追杀', '提兵',\
            "军士","左右","引兵","次日","大喜","喊声","之后","不得",'去路', '伏于',\
            '老夫','下令','炮响','无人','死者', '他人', '某愿', '百万', '火光',\
            "于是","今日","不敢","人马","一人","不知","下文",'三千','一彪','一枝',\
            '截住', '起身', '之士', '之下', '三日','营寨', '不过', '用兵','不已',\
            "众将","只见","大叫","上马","此人","忽然","下马","因此","追赶",'一齐',\
            "后人","背后","何不","城中","一面","忽报","大军","何故","分付",'报知',\
            "先锋","然后","不如","赶来","原来","令人","正是","未知","大事",'随后',\
            "一声","分解",'出马','且说','众官','之兵','领兵','之计','前面','何人',\
            '一日', '准备', '其言','相见','若何','而行','必有','此事','亲自',\
            '之中','忽见','立于','大王','此时','当先','三路','必然','马下','杀出',\
            '是夜','之间','小路','无不', '有人','望见','之意','城下','前来',\
            '出迎','武士','两路','四面','本部','奔走','一阵','连夜','城外','人报',\
            '杀来','杀入', '众人', '城门','当日','何以','前进','两军','而出','何处',\
            '两个','来到','岂可','兴兵','三人','为首','性命','山上','掩杀','进发',\
            '此言','之心','有失','不及', '闻知', '一千', '到来', '不到'}
txt = open('C:\\Users\\Gan\\Desktop\\实例10-文本词频统计源代码\\三国演义.txt', "r", encoding='utf-8').read()
words  = jieba.lcut(txt)
counts = {}
for word in words:
    if len(word) == 1:
        continue
    elif word == "诸葛亮" or word == "孔明曰" or word =='孔明笑':
        rword = "孔明"
    elif word == "关公" or word == "云长":
        rword = "关羽"
    elif word == "玄德" or word == "玄德曰" or word == "先主" or word == "皇叔"\
    or word == "刘玄德" or word == "刘玄大" or word == "使君":
        rword = "刘备"
    elif word == "孟德" or word == "丞相":
        rword = "曹操"
    elif word =="吴侯":
        rword = "孙权"
    else:
        rword = word
    counts[rword] = counts.get(rword,0) + 1
for word in excludes:
    del counts[word]
items = list(counts.items())
items.sort(key=lambda x:x[1], reverse=True) 
keyword =[]
for i in range(200):
    word, count = items[i]
    print ("{0:<10}{1:>5}".format(word, count))
    keyword.append(word)
keyword

words = (' '.join(keyword))
mask = imread('C:\\Users\\Gan\\Desktop\\b.jpg')
w = wordcloud.WordCloud(font_path ='simsun',mask = mask,background_color ="white",\
                        width = 1000, height = 700)
w.generate(words)
w.to_file("p.png")

